# 2_1
# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_arr = [20, 20.1, "strr"]
for i in my_arr:
    print(i, " type ", type(i))
